---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.KeyBasedTreeEntryTable
source: html/ef0d6838-f9e3-2bf6-0bf7-62a66ecec5d1.htm
---
# KeyBasedTreeEntryTable Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.